Autodesk.Revit.DB.ExternallyTaggedGeometryObject.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternallyTaggedGeometryObject.ExternalId
The external Id of the geometry object.
Since:
2022

Autodesk.Revit.DB.ExternallyTaggedGeometryObject
Base class for ExternallyTaggedGeometryObject and ExternallyTaggedSolid.
Since:
2022